Revit 2027 API
SpaceSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SpaceSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As SpaceSetIterator
public:
virtual SpaceSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> SpaceSetIterator
override ForwardIterator : unit -> SpaceSetIterator
Return Value
SpaceSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace